; domain
(define (domain joint_teleport-assistance6_domain)
(:requirements :typing :action-costs)

(:types
    place telstatus - object
)

(:constants
    origin destination disabled - telstatus
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (at-prime ?p -  place)
    (at-teleport ?p - place ?s -  telstatus)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (adj-walk ?p1 - place ?p2 -  place)
)

(:functions
    (total-cost) - number
)

(:action sup_activate-teleport-origin
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_origin_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos origin)
        (not (teleport_origin_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_activate-teleport-destination
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_destination_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos destination)
        (not (teleport_destination_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_use-teleport
    :parameters (?pos1 ?pos2 - place)
    :precondition (and
        (supporter_turn)
        (at-prime ?pos1)
        (at-teleport ?pos1 origin)
        (at-teleport ?pos2 destination)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-prime ?pos2)
        (not (at-prime ?pos1))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_teleport-assistance6_problem_160)
(:domain joint_teleport-assistance6_domain)
(:objects
    pos0-4 pos0-6 pos1-1 pos1-4 pos1-5 pos2-4 pos2-6 pos3-0 pos3-1 pos3-5 pos3-6 pos4-1 pos4-3 pos4-5 pos5-0 pos5-1 pos5-2 pos5-6 pos6-2 pos6-3 pos6-4 pos7-4 pos7-5 pos8-5 pos9-0 - place
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (at-teleport pos6-4 disabled)
    (at-teleport pos3-5 disabled)
    (at-teleport pos4-1 disabled)
    (at-teleport pos2-4 disabled)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (at-prime pos3-0)
    (adj-walk pos0-4 pos1-4)
    (adj-walk pos1-4 pos0-4)
    (adj-walk pos1-4 pos1-5)
    (adj-walk pos1-5 pos1-4)
    (adj-walk pos1-4 pos2-4)
    (adj-walk pos2-4 pos1-4)
    (adj-walk pos2-6 pos3-6)
    (adj-walk pos3-6 pos2-6)
    (adj-walk pos3-0 pos3-1)
    (adj-walk pos3-1 pos3-0)
    (adj-walk pos3-1 pos4-1)
    (adj-walk pos4-1 pos3-1)
    (adj-walk pos3-5 pos3-6)
    (adj-walk pos3-6 pos3-5)
    (adj-walk pos3-5 pos4-5)
    (adj-walk pos4-5 pos3-5)
    (adj-walk pos4-1 pos5-1)
    (adj-walk pos5-1 pos4-1)
    (adj-walk pos5-0 pos5-1)
    (adj-walk pos5-1 pos5-0)
    (adj-walk pos5-1 pos5-2)
    (adj-walk pos5-2 pos5-1)
    (adj-walk pos5-2 pos6-2)
    (adj-walk pos6-2 pos5-2)
    (adj-walk pos6-2 pos6-3)
    (adj-walk pos6-3 pos6-2)
    (adj-walk pos6-3 pos6-4)
    (adj-walk pos6-4 pos6-3)
    (adj-walk pos6-4 pos7-4)
    (adj-walk pos7-4 pos6-4)
    (adj-walk pos7-4 pos7-5)
    (adj-walk pos7-5 pos7-4)
    (adj-walk pos7-5 pos8-5)
    (adj-walk pos8-5 pos7-5)
)

(:goal
  (and
    (at-prime pos6-2)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_activate-teleport-origin pos4-1)
   deleted: (supporter_turn) (teleport_origin_can_be_activated) (at-teleport pos4-1 disabled)
   added: (prime_turn) (at-teleport pos4-1 origin)
   goals met: 0 of 1
2. (pri_walk pos3-0 pos3-1)
   deleted: (prime_turn) (at-prime pos3-0)
   added: (supporter_turn) (at-prime pos3-1)
   goals met: 0 of 1
3. (sup_activate-teleport-destination pos6-4)
   deleted: (supporter_turn) (teleport_destination_can_be_activated) (at-teleport pos6-4 disabled)
   added: (prime_turn) (at-teleport pos6-4 destination)
   goals met: 0 of 1
4. (pri_walk pos3-1 pos4-1)
   deleted: (prime_turn) (at-prime pos3-1)
   added: (supporter_turn) (at-prime pos4-1)
   goals met: 0 of 1
5. (sup_use-teleport pos4-1 pos6-4)
   deleted: (supporter_turn) (at-prime pos4-1)
   added: (prime_turn) (at-prime pos6-4)
   goals met: 0 of 1
6. (pri_walk pos6-4 pos6-3)
   deleted: (prime_turn) (at-prime pos6-4)
   added: (supporter_turn) (at-prime pos6-3)
   goals met: 0 of 1
7. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
8. (pri_walk pos6-3 pos6-2)
   deleted: (prime_turn) (at-prime pos6-3)
   added: (supporter_turn) (at-prime pos6-2)
   goals met: 1 of 1
